import socket

# Указываем адрес и порт, где будет работать сервер
host = '127.0.0.1' # Специальный IP-адрес loopback
port = 8888 # Порт

s = socket.socket(socket.AF_INET, socket.SOCK_STREAM) # Создаем сокет, протоколы IP и TCP

s.bind((host, port)) # Привязываем операцией bind сокет к IP-адресу и порту

s.listen(5) # Начинаем принимать соединения
print(f"Сервер запущен, IP {host}, порт {port}.") # Логирование для удобства
print("Ожидаю подключения...")

conn, addr = s.accept() # Ждем подключения клиента
print(f"Подключился клиент {addr}")

# После подключения клиента запускаем бесконечный цикл
# в котором будет читать поступающие данные
while True:
    data = conn.recv(1024) # Читаем 1024 байта
    if not data: # Если прочитали пустое значение, то данные закончились
        break # В этом случае выходим из цикла
    print(f"От клиента получены данные")     # Все полученные данные отправляем обратно клиенту
    print(data)
    print("Передаю данные обратно клиенту")
    conn.sendall(data)
conn.close() # Закрываем соединение
print("Завершение работы...")
s.close()